[Killed] ArithmeticOperator
sparkbox/AOC-2019/day01/index.js:8:39
 
 const inputData = fs.readFileSync(path.resolve(__dirname, 'data.txt'), 'utf8');
 
-const getFuelRequirementByMass = m => Math.floor(m / 3) - 2;
+const getFuelRequirementByMass = m => Math.floor(m / 3) + 2;
 
 const getFuel1 = array => array.map(item => getFuelRequirementByMass(item));

[Killed] ArithmeticOperator
sparkbox/AOC-2019/day01/index.js:8:50
 
 const inputData = fs.readFileSync(path.resolve(__dirname, 'data.txt'), 'utf8');
 
-const getFuelRequirementByMass = m => Math.floor(m / 3) - 2;
+const getFuelRequirementByMass = m => Math.floor(m * 3) - 2;
 
 const getFuel1 = array => array.map(item => getFuelRequirementByMass(item));

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/index.js:10:37
 
 const getFuelRequirementByMass = m => Math.floor(m / 3) - 2;
 
-const getFuel1 = array => array.map(item => getFuelRequirementByMass(item));
+const getFuel1 = array => array.map(() => undefined);
 
 const reduceFuelArr = fuelArr =>

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/index.js:10:18
 
 const getFuelRequirementByMass = m => Math.floor(m / 3) - 2;
 
-const getFuel1 = array => array.map(item => getFuelRequirementByMass(item));
+const getFuel1 = () => undefined;
 
 const reduceFuelArr = fuelArr =>

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/index.js:12:23
 
 const getFuel1 = array => array.map(item => getFuelRequirementByMass(item));
 
-const reduceFuelArr = fuelArr =>
-  reduce((total, currentValue) => total + currentValue, 0, fuelArr);
+const reduceFuelArr = () => undefined;
 
 const getFuelForMass = pipe(convertInputToArray, getFuel1, reduceFuelArr);

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/index.js:13:10
 const getFuel1 = array => array.map(item => getFuelRequirementByMass(item));
 
 const reduceFuelArr = fuelArr =>
-  reduce((total, currentValue) => total + currentValue, 0, fuelArr);
+  reduce(() => undefined, 0, fuelArr);
 
 const getFuelForMass = pipe(convertInputToArray, getFuel1, reduceFuelArr);

[Killed] ArithmeticOperator
sparkbox/AOC-2019/day01/index.js:13:35
 const getFuel1 = array => array.map(item => getFuelRequirementByMass(item));
 
 const reduceFuelArr = fuelArr =>
-  reduce((total, currentValue) => total + currentValue, 0, fuelArr);
+  reduce((total, currentValue) => total - currentValue, 0, fuelArr);
 
 const getFuelForMass = pipe(convertInputToArray, getFuel1, reduceFuelArr);

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/index.js:21:28
 // PART TWO
 //-------------------------------------------------------------------
 
-const getFuelRecursively = (totalFuel, accumulator = 0) =>
-  totalFuel <= 0
-    ? accumulator
-    : getFuelRecursively(
-        getFuelRequirementByMass(totalFuel),
-        totalFuel + accumulator
-      );
+const getFuelRecursively = () => undefined;
 
 const getFuel = input =>

[Killed] EqualityOperator
sparkbox/AOC-2019/day01/index.js:22:3
 //-------------------------------------------------------------------
 
 const getFuelRecursively = (totalFuel, accumulator = 0) =>
-  totalFuel <= 0
+  totalFuel > 0
     ? accumulator
     : getFuelRecursively(

[Killed] ConditionalExpression
sparkbox/AOC-2019/day01/index.js:22:3
 //-------------------------------------------------------------------
 
 const getFuelRecursively = (totalFuel, accumulator = 0) =>
-  totalFuel <= 0
+  false
     ? accumulator
     : getFuelRecursively(

[Killed] ArithmeticOperator
sparkbox/AOC-2019/day01/index.js:26:9
     ? accumulator
     : getFuelRecursively(
         getFuelRequirementByMass(totalFuel),
-        totalFuel + accumulator
+        totalFuel - accumulator
       );
 

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/index.js:29:17
         totalFuel + accumulator
       );
 
-const getFuel = input =>
-  reduce(
-    (acc, value) =>
-      add(acc, getFuelRecursively(getFuelRequirementByMass(value))),
-    0,
-    convertInputToArray(input)
-  );
+const getFuel = () => undefined;
 
 module.exports = {

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/index.js:31:5
 
 const getFuel = input =>
   reduce(
-    (acc, value) =>
-      add(acc, getFuelRecursively(getFuelRequirementByMass(value))),
+    () => undefined,
     0,
     convertInputToArray(input)

[Killed] ObjectLiteral
sparkbox/AOC-2019/day01/index.js:37:18
     convertInputToArray(input)
   );
 
-module.exports = {
-  getFuelForMass,
-  getFuel
-};
+module.exports = {};
 
