[Killed] BlockStatement
sparkbox/AOC-2019/day04/doublePasswordFinder1.js:6:35
 const { conditionChecker } = require('./utils/conditionChecker');
 const { pipe, filter } = require('ramda');
 
-const digitCounter = numString => {
-  const counter = new Set();
-
-  [...numString].forEach(item => {
-    counter[item] = counter[item] ? counter[item] + 1 : 1;
-  });
-
-  return counter;
-};
+const digitCounter = numString => {};
 
 const isGroupOfTwo = numString => {

[Killed] BlockStatement
sparkbox/AOC-2019/day04/doublePasswordFinder1.js:9:34
 const digitCounter = numString => {
   const counter = new Set();
 
-  [...numString].forEach(item => {
-    counter[item] = counter[item] ? counter[item] + 1 : 1;
-  });
+  [...numString].forEach(item => {});
 
   return counter;

[Killed] ArithmeticOperator
sparkbox/AOC-2019/day04/doublePasswordFinder1.js:10:37
   const counter = new Set();
 
   [...numString].forEach(item => {
-    counter[item] = counter[item] ? counter[item] + 1 : 1;
+    counter[item] = counter[item] ? counter[item] - 1 : 1;
   });
 

[Killed] BlockStatement
sparkbox/AOC-2019/day04/doublePasswordFinder1.js:16:35
   return counter;
 };
 
-const isGroupOfTwo = numString => {
-  const counter = digitCounter(numString);
-
-  return Object.keys(counter).filter(key => counter[key] === 2).length !== 0;
-};
+const isGroupOfTwo = numString => {};
 
 const doublePasswordFinder1 = (start, end) =>

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/doublePasswordFinder1.js:19:10
 const isGroupOfTwo = numString => {
   const counter = digitCounter(numString);
 
-  return Object.keys(counter).filter(key => counter[key] === 2).length !== 0;
+  return true;
 };
 

[Killed] EqualityOperator
sparkbox/AOC-2019/day04/doublePasswordFinder1.js:19:10
 const isGroupOfTwo = numString => {
   const counter = digitCounter(numString);
 
-  return Object.keys(counter).filter(key => counter[key] === 2).length !== 0;
+  return Object.keys(counter).filter(key => counter[key] === 2).length === 0;
 };
 

[Killed] ArrowFunction
sparkbox/AOC-2019/day04/doublePasswordFinder1.js:22:31
   return Object.keys(counter).filter(key => counter[key] === 2).length !== 0;
 };
 
-const doublePasswordFinder1 = (start, end) =>
-  pipe(
-    generateArray,
-    toStringsArray,
-    filter(conditionChecker(isGroupOfTwo))
-  )(start, end);
+const doublePasswordFinder1 = () => undefined;
 
 module.exports = doublePasswordFinder1;
