[Killed] ArithmeticOperator
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:1:38
-const sortByNumericValue = (a, b) => a - b;
+const sortByNumericValue = (a, b) => a + b;
 
 const conditionCheck = numString =>

[Killed] ArrowFunction
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:1:28
-const sortByNumericValue = (a, b) => a - b;
+const sortByNumericValue = () => undefined;
 
 const conditionCheck = numString =>

[Killed] ArrowFunction
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:3:24
 const sortByNumericValue = (a, b) => a - b;
 
-const conditionCheck = numString =>
-  numString.length === 6 &&
-  numString === [...numString].sort(sortByNumericValue).join('');
+const conditionCheck = () => undefined;
 
 const doublePasswordFinder2 = (start, end) => {

[Killed] LogicalOperator
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:4:3
 const sortByNumericValue = (a, b) => a - b;
 
 const conditionCheck = numString =>
-  numString.length === 6 &&
-  numString === [...numString].sort(sortByNumericValue).join('');
+  numString.length === 6 || numString === [...numString].sort(sortByNumericValue).join('');
 
 const doublePasswordFinder2 = (start, end) => {

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:4:3
 const sortByNumericValue = (a, b) => a - b;
 
 const conditionCheck = numString =>
-  numString.length === 6 &&
-  numString === [...numString].sort(sortByNumericValue).join('');
+  true;
 
 const doublePasswordFinder2 = (start, end) => {

[Killed] EqualityOperator
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:5:3
 
 const conditionCheck = numString =>
   numString.length === 6 &&
-  numString === [...numString].sort(sortByNumericValue).join('');
+  numString !== [...numString].sort(sortByNumericValue).join('');
 
 const doublePasswordFinder2 = (start, end) => {

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:5:3
 
 const conditionCheck = numString =>
   numString.length === 6 &&
-  numString === [...numString].sort(sortByNumericValue).join('');
+  true;
 
 const doublePasswordFinder2 = (start, end) => {

[Killed] BlockStatement
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:7:47
   numString.length === 6 &&
   numString === [...numString].sort(sortByNumericValue).join('');
 
-const doublePasswordFinder2 = (start, end) => {
-  const result = [];
-
-  for (let i = start; i <= end; i++) {
-    const numString = i.toString();
-
-    if (conditionCheck(numString)) {
-      let cache = new Set();
-
-      [...numString].forEach(item => {
-        cache[item] = cache[item] ? cache[item] + 1 : 1;
-      });
-
-      Object.keys(cache).filter(key => cache[key] === 2).length !== 0 &&
-        result.push(numString);
-    }
-  }
-  return result;
-};
+const doublePasswordFinder2 = (start, end) => {};
 
 module.exports = doublePasswordFinder2;

[Killed] ArrayDeclaration
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:8:18
   numString === [...numString].sort(sortByNumericValue).join('');
 
 const doublePasswordFinder2 = (start, end) => {
-  const result = [];
+  const result = ["Stryker was here"];
 
   for (let i = start; i <= end; i++) {

[Killed] BlockStatement
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:10:38
 const doublePasswordFinder2 = (start, end) => {
   const result = [];
 
-  for (let i = start; i <= end; i++) {
-    const numString = i.toString();
-
-    if (conditionCheck(numString)) {
-      let cache = new Set();
-
-      [...numString].forEach(item => {
-        cache[item] = cache[item] ? cache[item] + 1 : 1;
-      });
-
-      Object.keys(cache).filter(key => cache[key] === 2).length !== 0 &&
-        result.push(numString);
-    }
-  }
+  for (let i = start; i <= end; i++) {}
   return result;
 };

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:13:9
   for (let i = start; i <= end; i++) {
     const numString = i.toString();
 
-    if (conditionCheck(numString)) {
+    if (false) {
       let cache = new Set();
 

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:13:9
   for (let i = start; i <= end; i++) {
     const numString = i.toString();
 
-    if (conditionCheck(numString)) {
+    if (true) {
       let cache = new Set();
 

[Killed] BlockStatement
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:16:38
     if (conditionCheck(numString)) {
       let cache = new Set();
 
-      [...numString].forEach(item => {
-        cache[item] = cache[item] ? cache[item] + 1 : 1;
-      });
+      [...numString].forEach(item => {});
 
       Object.keys(cache).filter(key => cache[key] === 2).length !== 0 &&

[Killed] ArithmeticOperator
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:17:37
       let cache = new Set();
 
       [...numString].forEach(item => {
-        cache[item] = cache[item] ? cache[item] + 1 : 1;
+        cache[item] = cache[item] ? cache[item] - 1 : 1;
       });
 

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:20:7
         cache[item] = cache[item] ? cache[item] + 1 : 1;
       });
 
-      Object.keys(cache).filter(key => cache[key] === 2).length !== 0 &&
-        result.push(numString);
+      true;
     }
   }

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/doublePasswordFinder2.js:20:7
         cache[item] = cache[item] ? cache[item] + 1 : 1;
       });
 
-      Object.keys(cache).filter(key => cache[key] === 2).length !== 0 &&
+      true &&
         result.push(numString);
     }
