[Killed] ArrowFunction
sparkbox/AOC-2019/day01/toArray.js:1:31
-exports.convertInputToArray = input =>
-  input
-    .toString()
-    .split(/\n|\$/)
-    .map(item => parseInt(item, 10));
+exports.convertInputToArray = () => undefined;
 

[Killed] ArrowFunction
sparkbox/AOC-2019/day01/toArray.js:5:10
   input
     .toString()
     .split(/\n|\$/)
-    .map(item => parseInt(item, 10));
+    .map(() => undefined);
 
