[Survived] ArrowFunction
sparkbox/AOC-2019/day04/duplicatesPasswordFinder1.js:8:35
 
 const { pipe, filter } = require('ramda');
 
-const duplicatesPasswordFinder1 = (start, end) =>
-  pipe(
-    generateArray,
-    toStringsArray,
-    filter(conditionChecker(isConsecutiveDuplicates))
-  )(start, end);
+const duplicatesPasswordFinder1 = () => undefined;
 
 module.exports = duplicatesPasswordFinder1;
