[Survived] ArrowFunction
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:4:24
 const { isConsecutiveDuplicates } = require('../utils/isConsecutiveDuplicates');
 const possiblePasswords = [];
 
-const conditionCheck = numString =>
-  numString.length === 6 &&
-  isConsecutiveDuplicates(numString) &&
-  numString === [...numString].sort().join('');
+const conditionCheck = () => undefined;
 
 const duplicatesPasswordFinder2 = (start, end) => {

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:5:3
 const possiblePasswords = [];
 
 const conditionCheck = numString =>
-  numString.length === 6 &&
-  isConsecutiveDuplicates(numString) &&
-  numString === [...numString].sort().join('');
+  false;
 
 const duplicatesPasswordFinder2 = (start, end) => {

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:5:3
 const possiblePasswords = [];
 
 const conditionCheck = numString =>
-  numString.length === 6 &&
-  isConsecutiveDuplicates(numString) &&
+  false &&
   numString === [...numString].sort().join('');
 

[Killed] EqualityOperator
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:7:3
 const conditionCheck = numString =>
   numString.length === 6 &&
   isConsecutiveDuplicates(numString) &&
-  numString === [...numString].sort().join('');
+  numString !== [...numString].sort().join('');
 
 const duplicatesPasswordFinder2 = (start, end) => {

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:7:3
 const conditionCheck = numString =>
   numString.length === 6 &&
   isConsecutiveDuplicates(numString) &&
-  numString === [...numString].sort().join('');
+  false;
 
 const duplicatesPasswordFinder2 = (start, end) => {

[Killed] BlockStatement
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:9:51
   isConsecutiveDuplicates(numString) &&
   numString === [...numString].sort().join('');
 
-const duplicatesPasswordFinder2 = (start, end) => {
-  for (let i = start; i <= end; i++) {
-    if (conditionCheck(i.toString())) {
-      possiblePasswords.push(i.toString());
-    }
-  }
-  return possiblePasswords;
-};
+const duplicatesPasswordFinder2 = (start, end) => {};
 
 module.exports = duplicatesPasswordFinder2;

[Killed] BlockStatement
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:10:38
   numString === [...numString].sort().join('');
 
 const duplicatesPasswordFinder2 = (start, end) => {
-  for (let i = start; i <= end; i++) {
-    if (conditionCheck(i.toString())) {
-      possiblePasswords.push(i.toString());
-    }
-  }
+  for (let i = start; i <= end; i++) {}
   return possiblePasswords;
 };

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:10:23
   numString === [...numString].sort().join('');
 
 const duplicatesPasswordFinder2 = (start, end) => {
-  for (let i = start; i <= end; i++) {
+  for (let i = start; false; i++) {
     if (conditionCheck(i.toString())) {
       possiblePasswords.push(i.toString());

[Killed] BlockStatement
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:11:39
 
 const duplicatesPasswordFinder2 = (start, end) => {
   for (let i = start; i <= end; i++) {
-    if (conditionCheck(i.toString())) {
-      possiblePasswords.push(i.toString());
-    }
+    if (conditionCheck(i.toString())) {}
   }
   return possiblePasswords;

[Killed] ConditionalExpression
sparkbox/AOC-2019/day04/duplicatesPasswordFinder2.js:11:9
 
 const duplicatesPasswordFinder2 = (start, end) => {
   for (let i = start; i <= end; i++) {
-    if (conditionCheck(i.toString())) {
+    if (true) {
       possiblePasswords.push(i.toString());
     }
